CSI API ETABS v1
cAreaObj.GetMass Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetMass(
	string Name,
	ref double MassOverL2
)
Function GetMass (
	Name As String,
	ByRef MassOverL2 As Double
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim MassOverL2 As Double
Dim returnValue As Integer
returnValue = instance.GetMass(Name, MassOverL2)
int GetMass(
	String^ Name,
	double% MassOverL2
)
abstract GetMass :
        Name : string *
        MassOverL2 : float byref -> int
Parameters
Name
Type: System.String
MassOverL2
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace